<table align="left" width=100%>
    <tr>
        <td width="10%">
            <img src="in_class.png">
        </td>
        <td>
            <div align="center">
                <font color="#21618C" size=8px>
                    <b>Inclass - Lab<br> (Day 2)
                    </b>
                </font>
            </div>
        </td>
    </tr>
</table>

## Table of Content
1. **[Data Structures with Examples](#Data_Structures)**
2. **[Create and Manipulate the DataFrames](#create_manipulate)**
3. **[Sort](#sorting)**
4. **[Rank](#ranking)**

### Let's begin with some hands-on practice exercises

<a id='Data_Structures'></a>
## 1. Data Structures with Examples:

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>1. Write a program to create a dataframe from list of lists
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below nested list:**<br>

        data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]

In [2]:
# type your code here
data = [['Joy', 21], ['Mia', 15], ['Sam', 14]]

In [3]:
data1 = np.array(data)
data1

array([['Joy', '21'],
       ['Mia', '15'],
       ['Sam', '14']], dtype='<U21')

In [ ]:
data1= np.

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>2. Extract the second word from the given string
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below string:**<br>
    
    sentence = 'Be confident and be yourself'

In [5]:
# type your code here
sentence = 'Be confident and be yourself'
print(sentence[3:12])

confident

<a id='create_manipulate'></a>
## 2. Create and Manipulate the DataFrames:

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>3. Split the 'Name' column into two separate columns as First_Name and Last_Name </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Salary</th>
</tr>
<tr>
<td>Emma Larter</td>
<td>3200</td>
</tr>
<tr>
<td>Mia Junior</td>
<td>4500</td>
</tr>
<tr>
<td>Sophia Depp</td>
<td>3600</td>
</tr>
<tr>
<td>James Smith</td>
<td>5596</td>
</tr>
   
</table>

In [12]:
# type your code here

mean = [["Emma Larter" , 3200],["Mia Junior" , 4500],["Sophia Depp" , 3600], ["James Smith" , 5596]]
mean_df= pd.DataFrame(mean, columns=["Name" , "Salary"])
print(mean_df)

          Name  Salary
0  Emma Larter    3200
1   Mia Junior    4500
2  Sophia Depp    3600
3  James Smith    5596

In [18]:
new = mean_df["Name"].str.split(" ", n = 1, expand =True)

mean_df[" First name"] =new[0]
mean_df["Last name" ] =new[1]
mean_df.drop(columns= ["Name"], inplace= True)

KeyError: 'Name'

In [ ]:
rankings_pd.rename(columns = {'test':'TEST'}, inplace = True)

In [25]:
new.rename(columns = {"0": "first_name" , "1":"last_name"}, inplace = True)

In [59]:
new.rename(columns = {"0": "first_name" , "1":"last_name"}, inplace = True)

In [61]:
new.columns = ["first_name","last_name"]

In [62]:
new

  first_name last_name
0       Emma    Larter
1        Mia    Junior
2     Sophia      Depp
3      James     Smith

In [31]:
print(new.columns)

Int64Index([0, 1], dtype='int64')

In [52]:
print(new)

        0       1
0    Emma  Larter
1     Mia  Junior
2  Sophia    Depp
3   James   Smith

In [60]:
new

        0       1
0    Emma  Larter
1     Mia  Junior
2  Sophia    Depp
3   James   Smith

In [19]:
new

        0       1
0    Emma  Larter
1     Mia  Junior
2  Sophia    Depp
3   James   Smith

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>4. Select the rows from below dataframe where marks are less than 60 </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Marks</th>
</tr>
<tr>
<td>John</td>
<td>90</td>
</tr>
<tr>
<td>Robert</td>
<td>50</td>
</tr>
<tr>
<td>Jonny</td>
<td>89</td>
</tr>
<tr>
<td>Mia</td>
<td>55</td>
</tr>
   
</table>

In [36]:
# type your code here

a = [["john",90],["Robert",50],["jonny",89],["Mia",55]]
score =  pd.DataFrame(a, columns=["Name", "Marks"])
print(score)

     Name  Marks
0    john     90
1  Robert     50
2   jonny     89
3     Mia     55

In [ ]:
df.loc[df[‘column name’] condition]

In [37]:
score.loc[score["Marks"]<60]

     Name  Marks
1  Robert     50
3     Mia     55

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>5. Write a program to select the rows where the sales are higher than 60000 for Mumbai </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [45]:
# type your code here
pr = [["A","Mumbai",4000],["B","Pune",45000],["A","Hydrabad",50000],["C","Mumbai",90000],["D","Pune",89000],["A","Delhi",87000],
      ["D","Hydrabad",85000],["A","Pune",78000],["C","Mumbai",89000],["B","Pune",70000]]
product = pd.DataFrame(pr,columns=["Store","Location","Sales"])
print(product)
product

  Store  Location  Sales
0     A    Mumbai   4000
1     B      Pune  45000
2     A  Hydrabad  50000
3     C    Mumbai  90000
4     D      Pune  89000
5     A     Delhi  87000
6     D  Hydrabad  85000
7     A      Pune  78000
8     C    Mumbai  89000
9     B      Pune  70000

  Store  Location  Sales
0     A    Mumbai   4000
1     B      Pune  45000
2     A  Hydrabad  50000
3     C    Mumbai  90000
4     D      Pune  89000
5     A     Delhi  87000
6     D  Hydrabad  85000
7     A      Pune  78000
8     C    Mumbai  89000
9     B      Pune  70000

In [46]:
product.loc[product["Sales"]>60000]

  Store  Location  Sales
3     C    Mumbai  90000
4     D      Pune  89000
5     A     Delhi  87000
6     D  Hydrabad  85000
7     A      Pune  78000
8     C    Mumbai  89000
9     B      Pune  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>6. Write a program to select stores located in Hyderabad</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [3]:
# type your code here
pr = [["A","Mumbai",4000],["B","Pune",45000],["A","Hydrabad",50000],["C","Mumbai",90000],["D","Pune",89000],["A","Delhi",87000],
      ["D","Hydrabad",85000],["A","Pune",78000],["C","Mumbai",89000],["B","Pune",70000]]
product = pd.DataFrame(pr,columns=["Store","Location","Sales"])
print(product)
product

In [48]:
product.loc[product["Location"]=="Hydrabad"]

  Store  Location  Sales
2     A  Hydrabad  50000
6     D  Hydrabad  85000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>7. Write a program to replace the 'Store' column with the values A, B, C, and D with Store_A,  Store_B, Store_C and Store_D respectively </b>  
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [ ]:
df.rename(columns = {'old_col1':'new_col1', 'old_col2':'new_col2'}, inplace = True)

In [ ]:
data.rename(index = {"Avery Bradley": "NEW NAME",
                     "Jae Crowder":"NEW NAME 2"},
                                 inplace = True)

In [ ]:
df.rename(index={0: "x", 1: "y", 2: "z"})

In [73]:
# type your code here
product.replace({"Store":{"A":"Store_A","B":"Store_B","C":"Store_C","D":"Store_D"}},inplace = True)
product

     Store  Location  Sales
0  Store_A    Mumbai   4000
1  Store_B      Pune  45000
2  Store_A  Hydrabad  50000
3  Store_C    Mumbai  90000
4  Store_D      Pune  89000
5  Store_A     Delhi  87000
6  Store_D  Hydrabad  85000
7  Store_A      Pune  78000
8  Store_C    Mumbai  89000
9  Store_B      Pune  70000

In [71]:
print(product)

  Store  Location  Sales
0     A    Mumbai   4000
1     B      Pune  45000
2     A  Hydrabad  50000
3     C    Mumbai  90000
4     D      Pune  89000
5     A     Delhi  87000
6     D  Hydrabad  85000
7     A      Pune  78000
8     C    Mumbai  89000
9     B      Pune  70000

In [51]:
list(product)

['Store', 'Location', 'Sales']

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>8. Create a dataframe in pandas using the given list.
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the below list**

        city = ['Delhi', 'Mumbai', 'Chennai', 'Kolkata']

In [78]:
# type your code here
place =(["Delhi","Mumbai","Chennai","Kolkata"])
cities = pd.DataFrame(place,columns=["city"])
cities

      city
0    Delhi
1   Mumbai
2  Chennai
3  Kolkata

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>9. Save a given dataframe to a csv file
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [289]:
# type your code here
pr = [["A","Mumbai",40000],["B","Pune",45000],["A","Hydrabad",50000],["C","Mumbai",90000],["D","Pune",89000],["A","Delhi",87000],
      ["D","Hydrabad",85000],["A","Pune",78000],["C","Mumbai",89000],["B","Pune",70000]]
product = pd.DataFrame(pr,columns=["Store","Location","Sales"])
print(product)
product

  Store  Location  Sales
0     A    Mumbai  40000
1     B      Pune  45000
2     A  Hydrabad  50000
3     C    Mumbai  90000
4     D      Pune  89000
5     A     Delhi  87000
6     D  Hydrabad  85000
7     A      Pune  78000
8     C    Mumbai  89000
9     B      Pune  70000

  Store  Location  Sales
0     A    Mumbai  40000
1     B      Pune  45000
2     A  Hydrabad  50000
3     C    Mumbai  90000
4     D      Pune  89000
5     A     Delhi  87000
6     D  Hydrabad  85000
7     A      Pune  78000
8     C    Mumbai  89000
9     B      Pune  70000

In [81]:
product.to_csv("xyz.csv")

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>10. Find the maximum sales for each store
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [260]:
product.groupby(by="Store")["Sales"].max()

Store
A    87000
B    70000
C    90000
D    89000
Name: Sales, dtype: int64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>11. Write a program to select all columns, except the 'Location' from the given dataframe
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [ ]:

col = "y"
df1 = df.loc[:, df.columns != col]

print "DataFrame without Column-y: \n", df1

In [169]:
# type your code here
col = "Location"
product1 = product.loc[:, product.columns != col]
print product1

SyntaxError: Missing parentheses in call to 'print'. Did you mean print(product1)? (<ipython-input-169-6eb86c64eabf>, line 4)

In [ ]:
df.loc[:, df.columns != 'b']

In [166]:
product.loc[:, product.columns != "Location"]

  Store  Sales
0     A   4000
1     B  45000
2     A  50000
3     C  90000
4     D  89000
5     A  87000
6     D  85000
7     A  78000
8     C  89000
9     B  70000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>12. Write a program to insert a given column at the second position in a dataframe
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Age</th>
</tr>
<tr>
<td>Emma Larter</td>
<td>34</td>
</tr>
<tr>
<td>Mia Junior</td>
<td>59</td>
</tr>
<tr>
<td>Sophia Depp</td>
<td>32</td>
</tr>
<tr>
<td>James Smith</td>
<td>40</td>
</tr>
   
</table>

**Add the variable 'Salary' as second column**<br>
            
            Salary = [35000, 24000, 55000, 40000]

In [188]:
# type your code here
df = [["Emma Larter" , 34], ["Mia Junior" ,  59],["Sophia Depp" ,32],["James Smith" , 40]]
df1 = pd.DataFrame(df, columns=["Name" , "Age"])
sal = [35000, 24000, 55000, 40000]
df1["Salary"] = sal
df1
df1

          Name  Age  Salary
0  Emma Larter   34   35000
1   Mia Junior   59   24000
2  Sophia Depp   32   55000
3  James Smith   40   40000

In [185]:
sal = [35000, 24000, 55000, 40000]
dfa["Salary"] = sal
dfa

          Name  Age  Salary
0  Emma Larter   34   35000
1   Mia Junior   59   24000
2  Sophia Depp   32   55000
3  James Smith   40   40000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>13. Write a program to get the third observation of the given dataframe
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**

<table>
<tr>
<th>Name</th>
<th>Age</th>
</tr>
<tr>
<td>Emma Larter</td>
<td>34</td>
</tr>
<tr>
<td>Mia Junior</td>
<td>59</td>
</tr>
<tr>
<td>Sophia Depp</td>
<td>32</td>
</tr>
<tr>
<td>James Smith</td>
<td>40</td>
</tr>
</table>

In [205]:
# type your code here
df = [["Emma Larter" , 34], ["Mia Junior" ,  59],["Sophia Depp" ,32],["James Smith" , 40]]
df1 = pd.DataFrame(df, columns=["Name" , "Age"])
df1

          Name  Age
0  Emma Larter   34
1   Mia Junior   59
2  Sophia Depp   32
3  James Smith   40

In [ ]:
df.loc[df[‘Name’] == ‘Green’]

In [206]:
df1.loc[df1["Name"]=="Sophia Depp"]

          Name  Age
2  Sophia Depp   32

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>14. Write a program to create a dataframe from the provided lists</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the following lists to create your arrays:**
        
            columns = ["Science", "Maths", "English"]
            
            marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]
            
**Hint:** Convert the list marks into an array

In [209]:
# type your code here
columns = ["Science", "Maths", "English"]
c = np.array(columns)
marks = [[55, 78, 88], [93, 63, 83],[94, 74, 64]]          
m = np.array(marks)
print(c, m)

['Science' 'Maths' 'English'] [[55 78 88]
 [93 63 83]
 [94 74 64]]

In [211]:
df = pd.DataFrame(data = m,
                 columns = c)
df

   Science  Maths  English
0       55     78       88
1       93     63       83
2       94     74       64

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>15. Write a program to count total sales per store </b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [262]:
# type your code here
product.groupby(by="Store")["Sales"].sum()

Store
A    219000
B    115000
C    179000
D    174000
Name: Sales, dtype: int64

<a id='sorting'></a>
## 3. Sort

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>16. Write a program to sort the dataframe by 'Sales' in ascending order
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [290]:
# type your code here
product.sort_values("Sales", ascending = True)

  Store  Location  Sales
0     A    Mumbai  40000
1     B      Pune  45000
2     A  Hydrabad  50000
9     B      Pune  70000
7     A      Pune  78000
6     D  Hydrabad  85000
5     A     Delhi  87000
4     D      Pune  89000
8     C    Mumbai  89000
3     C    Mumbai  90000

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>17. Write a program to sort the dataframe by 'Store' in ascending order and by 'Sales' in descending order with respect to store simultaneously
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [291]:
# type your code here
product.sort_values(["Store","Sales"], ascending =[True , False])

  Store  Location  Sales
5     A     Delhi  87000
7     A      Pune  78000
2     A  Hydrabad  50000
0     A    Mumbai  40000
9     B      Pune  70000
1     B      Pune  45000
3     C    Mumbai  90000
8     C    Mumbai  89000
4     D      Pune  89000
6     D  Hydrabad  85000

<a id='ranking'></a>
## 4. Rank

<table align="left">
    <tr>
        <td width="6%">
            <img src="question_icon.png">
        </td>
        <td>
            <div align="left", style="font-size:120%">
                <font color="#21618C">
                    <b>18. Create a column 'Rank_sales' which contains the rank of each store based on sales of the product in ascending order
</b>
                </font>
            </div>
        </td>
    </tr>
</table>

**Use the dataframe given below:**
   
<table>
<tr>
<th>Store</th>
<th>Location</th>
<th>Sales</th>
</tr>
<tr>
<td>A</td>
<td>Mumbai</td>
<td>40000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>45000</td>
</tr>
<tr>
<td>A</td>
<td>Hyderabad</td>
<td>50000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>90000</td>
</tr>
<tr>
<td>D</td>
<td>Pune</td>
<td>89000</td>
</tr>
<tr>
<td>A</td>
<td>Delhi</td>
<td>87000</td>
</tr>
<tr>
<td>D</td>
<td>Hyderabad</td>
<td>85000</td>
</tr>
<tr>
<td>A</td>
<td>Pune</td>
<td>78000</td>
</tr>
<tr>
<td>C</td>
<td>Mumbai</td>
<td>89000</td>
</tr>
<tr>
<td>B</td>
<td>Pune</td>
<td>70000</td>
</tr>
   
</table>

In [298]:
# type your code here

asc_sales = product.sort_values("Sales", ascending = True)
SALES_PATTERN  = ["1ST","2ND", "3RD","4TH","5TH","6TH","7TH","8TH","9TH","10TH"]  
asc_sales ['Rank_sales'] = SALES_PATTERN
asc_sales

  Store  Location  Sales Rank_sales
0     A    Mumbai  40000        1ST
1     B      Pune  45000        2ND
2     A  Hydrabad  50000        3RD
9     B      Pune  70000        4TH
7     A      Pune  78000        5TH
6     D  Hydrabad  85000        6TH
5     A     Delhi  87000        7TH
4     D      Pune  89000        8TH
8     C    Mumbai  89000        9TH
3     C    Mumbai  90000       10TH